In [1]:
%load_ext sql

In [2]:
%sql sqlite:///vbo.db

In [3]:
%%sql
SELECT * FROM Orders LIMIT 3;

 * sqlite:///vbo.db
Done.

[(10248, 90, 5, '4.07.1996', 3),
 (10249, 81, 6, '5.07.1996', 1),
 (10250, 34, 4, '8.07.1996', 2)]

In [4]:
%%sql 
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///vbo.db
Done.

[('Categories',),
 ('Customers',),
 ('Employees',),
 ('OrderDetails',),
 ('Orders',),
 ('Products',),
 ('Shippers',),
 ('Suppliers',)]

### 1.)Find out how many customers are in the **Orders Table**.

In [5]:
%%sql
SELECT COUNT(CustomerID) AS Number_of_Customers FROM Orders

 * sqlite:///vbo.db
Done.

[(196,)]

### 2.)Find out how many unique customers there are in the Orders Table.

In [6]:
%%sql
SELECT COUNT( DISTINCT CustomerID) FROM Orders LIMIT 10

 * sqlite:///vbo.db
Done.

[(74,)]

### 3.)In the Customers table, find out how many customers are from which country.

In [7]:
%%sql
SELECT * FROM Customers LIMIT 2;

 * sqlite:///vbo.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')]

In [8]:
%%sql
SELECT  COUNT(CustomerID) AS Number_of_Customers, Country  FROM Customers GROUP BY Country ;

 * sqlite:///vbo.db
Done.

[(3, 'Argentina'),
 (2, 'Austria'),
 (2, 'Belgium'),
 (9, 'Brazil'),
 (3, 'Canada'),
 (2, 'Denmark'),
 (2, 'Finland'),
 (11, 'France'),
 (11, 'Germany'),
 (1, 'Ireland'),
 (3, 'Italy'),
 (5, 'Mexico'),
 (1, 'Norway'),
 (1, 'Poland'),
 (2, 'Portugal'),
 (5, 'Spain'),
 (2, 'Sweden'),
 (2, 'Switzerland'),
 (7, 'UK'),
 (13, 'USA'),
 (4, 'Venezuela')]

### 4.) FIND THE NAMES OF CUSTOMERS FROM CANADA OR BELGIUM

In [9]:
%%sql
SELECT CustomerName, Country  FROM Customers WHERE Country  IN ("Canada","Belgium");

 * sqlite:///vbo.db
Done.

[('Bottom-Dollar Marketse', 'Canada'),
 ('Laughing Bacchus Wine Cellars', 'Canada'),
 ('Maison Dewey', 'Belgium'),
 ('Mère Paillarde', 'Canada'),
 ('Suprêmes délices', 'Belgium')]

**5-)Find the number of customers in this grouping by doing group by operation first by country, then by city.**

In [10]:
%%sql
SELECT COUNT(CustomerID) AS Number_of_Customers, Country, City FROM Customers GROUP BY Country ,City limit 10;

 * sqlite:///vbo.db
Done.

[(3, 'Argentina', 'Buenos Aires'),
 (1, 'Austria', 'Graz'),
 (1, 'Austria', 'Salzburg'),
 (1, 'Belgium', 'Bruxelles'),
 (1, 'Belgium', 'Charleroi'),
 (1, 'Brazil', 'Campinas'),
 (1, 'Brazil', 'Resende'),
 (3, 'Brazil', 'Rio de Janeiro'),
 (4, 'Brazil', 'São Paulo'),
 (1, 'Canada', 'Montréal')]

**6-) Find all addresses with the phrase "da" anywhere in the customer addresses.**

In [11]:
%%sql
SELECT * FROM Customers LIMIT 2;

 * sqlite:///vbo.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')]

In [12]:
%%sql
SELECT Address FROM Customers WHERE Address LIKE "%da%";

 * sqlite:///vbo.db
Done.

[('Avda. de la Constitución 2222',),
 ('Sierras de Granada 9993',),
 ('Av. dos Lusíadas, 23',),
 ('Jardim das rosas n. 32',),
 ('Ing. Gustavo Moncada 8585 Piso 20-A',),
 ('Estrada da saúde n. 58',),
 ('Rua da Panificadora, 12',),
 ('Alameda dos Canàrios, 891',),
 ('Strada Provinciale 124',),
 ('Avda. Azteca 123',),
 ('722 DaVinci Blvd.',)]

**7. What are the names of the customer / customers living in Germany-Berlin?**

In [13]:
%%sql
SELECT * FROM Customers LIMIT 2

 * sqlite:///vbo.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')]

In [14]:
%%sql
SELECT CustomerName, Country, City FROM Customers WHERE Country="Germany" AND City="Berlin";

 * sqlite:///vbo.db
Done.

[('Alfreds Futterkiste', 'Germany', 'Berlin')]

**8. Find customers / clients living in Canada with "in" in their names**

In [15]:
%%sql
SELECT CustomerName,Country FROM Customers WHERE Country="Canada" and  CustomerName Like "%in%"

 * sqlite:///vbo.db
Done.

[('Laughing Bacchus Wine Cellars', 'Canada')]

**9-)What are the names and prices of the products whose prices are between 40 and 90?**

In [16]:
%%sql
SELECT * FROM Products LIMIT 3;

 * sqlite:///vbo.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)]

In [17]:
%%sql
SELECT ProductName , Price FROM Products Where Price between 40 and 90 order by price ;

 * sqlite:///vbo.db
Done.

[('Northwoods Cranberry Sauce', 40),
 ('Genen Shouyu', 43),
 ('Teatime Chocolate Biscuits', 43),
 ('Guaraná Fantástica', 43),
 ('Schoggi Schokolade', 43),
 ('Geitost', 43),
 ('Boston Crab Meat', 43),
 ('Røgede sild', 43),
 ('Zaanse koeken', 43),
 ('Ravioli Angelo', 43),
 ("Sirop d'érable", 43),
 ('Vegie-spread', 43),
 ('Louisiana Fiery Hot Pepper Sauce', 43),
 ('Rössle Sauerkraut', 45),
 ('Scottish Longbreads', 45),
 ('Ipoh Coffee', 46),
 ('Tarte au sucre', 49),
 ('Manjimup Dried Apples', 53),
 ('Raclette Courdavault', 55),
 ('Carnarvon Tigers', 62),
 ("Sir Rodney's Marmalade", 81)]

**10-) Find the names, prices and squares of prices of products with a price greater than 30 and make the names of all variables as follows:** _product name, product_ price, square of product_ price_

In [18]:
%%sql
SELECT ProductName AS product_name ,Price AS product_price, Price*Price AS square_of_product_price FROM Products Where price >= 30;

 * sqlite:///vbo.db
Done.

[("Uncle Bob's Organic Dried Pears", 30, 900),
 ('Northwoods Cranberry Sauce', 40, 1600),
 ('Mishi Kobe Niku', 97, 9409),
 ('Ikura', 31, 961),
 ('Queso Manchego La Pastora', 38, 1444),
 ('Genen Shouyu', 43, 1849),
 ('Alice Mutton', 39, 1521),
 ('Carnarvon Tigers', 62, 3844),
 ('Teatime Chocolate Biscuits', 43, 1849),
 ("Sir Rodney's Marmalade", 81, 6561),
 ('Guaraná Fantástica', 43, 1849),
 ('Gumbär Gummibärchen', 31, 961),
 ('Schoggi Schokolade', 43, 1849),
 ('Rössle Sauerkraut', 45, 2025),
 ('Thüringer Rostbratwurst', 123, 15129),
 ('Gorgonzola Telino', 435, 189225),
 ('Mascarpone Fabioli', 32, 1024),
 ('Geitost', 43, 1849),
 ('Côte de Blaye', 263, 69169),
 ('Boston Crab Meat', 43, 1849),
 ('Ipoh Coffee', 46, 2116),
 ('Røgede sild', 43, 1849),
 ('Zaanse koeken', 43, 1849),
 ('Manjimup Dried Apples', 53, 2809),
 ('Perth Pasties', 32, 1024),
 ('Gnocchi di nonna Alice', 38, 1444),
 ('Ravioli Angelo', 43, 1849),
 ('Raclette Courdavault', 55, 3025),
 ('Camembert Pierrot', 34, 1156),
 ("Sirop d'érable", 43, 1849),
 ('Tarte au sucre', 49, 2401),
 ('Vegie-spread', 43, 1849),
 ('Wimmers gute Semmelknödel', 33, 1089),
 ('Louisiana Fiery Hot Pepper Sauce', 43, 1849),
 ('Scottish Longbreads', 45, 2025),
 ('Gudbrandsdalsost', 36, 1296),
 ('Mozzarella di Giovanni', 34, 1156)]

**11. What are the names of the CategoryIDs, that is, the categories in the Products table?**

In [21]:
%%sql
SELECT * 
FROM Products 
LEFT JOIN Categories on Products.CategoryID = Categories.CategoryID limit 3;

 * sqlite:///vbo.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings')]

**12. What is the average price of the products in the beverages product category?**

In [23]:
%%sql
SELECT * 
FROM Products limit 3

 * sqlite:///vbo.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)]

In [27]:
%%sql
SELECT * 
FROM categories limit 3

 * sqlite:///vbo.db
Done.

[(1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (3, 'Confections', 'Desserts, candies, and sweet breads')]

In [28]:
%%sql
SELECT AVG(Price) 
FROM Products 
LEFT JOIN Categories on Products.CategoryID = categories.CategoryID 
WHERE CategoryName = 'Beverages';

 * sqlite:///vbo.db
Done.

[(42.75,)]

**13. Find the total earnings earned by customers living in the USA.**

In [31]:
%%sql 
SELECT * 
FROM Orders o 
LEFT JOIN OrderDetails od on o.OrderID = od.OrderID 
LEFT JOIN Products p on od.ProductID = p.ProductID 
LEFT JOIN Customers cu on o.CustomerID = cu.CustomerID limit 3

 * sqlite:///vbo.db
Done.

[(10248, 90, 5, '4.07.1996', 3, 1, 10248, 11, 12, 11, 'Queso Cabrales', 5, 4, '1 kg pkg.', 21, 90, 'Wilman Kala', 'Matti Karttunen', 'Keskuskatu 45', 'Helsinki', '21240', 'Finland'),
 (10248, 90, 5, '4.07.1996', 3, 2, 10248, 42, 10, 42, 'Singaporean Hokkien Fried Mee', 20, 5, '32 - 1 kg pkgs.', 14, 90, 'Wilman Kala', 'Matti Karttunen', 'Keskuskatu 45', 'Helsinki', '21240', 'Finland'),
 (10248, 90, 5, '4.07.1996', 3, 3, 10248, 72, 5, 72, 'Mozzarella di Giovanni', 14, 4, '24 - 200 g pkgs.', 34, 90, 'Wilman Kala', 'Matti Karttunen', 'Keskuskatu 45', 'Helsinki', '21240', 'Finland')]

In [32]:
%%sql 
SELECT SUM(p.Price) 
FROM Orders o 
LEFT JOIN OrderDetails od on o.OrderID = od.OrderID 
LEFT JOIN Products p on od.ProductID = p.ProductID 
LEFT JOIN Customers cu on o.CustomerID = cu.CustomerID where cu.Country = 'USA';

 * sqlite:///vbo.db
Done.

[(3762,)]

**14. Find the names of the CategoryIDs in the Products table, and then show the average product price per category.**

In [33]:
%%sql
SELECT AVG(Price), CategoryName 
FROM Products 
LEFT JOIN Categories on Products.CategoryID = Categories.CategoryID 
GROUP BY CategoryName;

 * sqlite:///vbo.db
Done.

[(42.75, 'Beverages'),
 (28.25, 'Condiments'),
 (33.76923076923077, 'Confections'),
 (74.9, 'Dairy Products'),
 (23.571428571428573, 'Grains/Cereals'),
 (55.166666666666664, 'Meat/Poultry'),
 (32.2, 'Produce'),
 (26.5, 'Seafood')]

**15. List the employees (EmployeeID) by their total sales, including their names.**

In [37]:
%%sql 
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///vbo.db
Done.

[('Categories',),
 ('Customers',),
 ('Employees',),
 ('OrderDetails',),
 ('Orders',),
 ('Products',),
 ('Shippers',),
 ('Suppliers',)]

In [36]:
%%sql 
SELECT * 
FROM Orders limit 3;

 * sqlite:///vbo.db
Done.

[(10248, 90, 5, '4.07.1996', 3),
 (10249, 81, 6, '5.07.1996', 1),
 (10250, 34, 4, '8.07.1996', 2)]

In [41]:
%%sql 
SELECT firstname, lastname,employeeid 
FROM employees limit 3;

 * sqlite:///vbo.db
Done.

[('Nancy', 'Davolio', 1), ('Andrew', 'Fuller', 2), ('Janet', 'Leverling', 3)]

In [42]:
%%sql
SELECT em.FirstName, SUM(p.Price) total_sales 
FROM Orders o 
LEFT JOIN OrderDetails od on o.OrderID = od.OrderID 
LEFT JOIN Products p on od.ProductID = p.ProductID 
LEFT JOIN Employees em on o.EmployeeID = em.EmployeeID 
GROUP BY o.EmployeeID 
ORDER BY total_sales DESC;

 * sqlite:///vbo.db
Done.

[('Margaret', 5515),
 ('Nancy', 4353),
 ('Janet', 3048),
 ('Michael', 2981),
 ('Laura', 2380),
 ('Robert', 1852),
 ('Andrew', 1550),
 ('Steven', 1408),
 ('Anne', 520)]